app/controllers/pins_controller.rb

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @pin = Pin.find(params[:id])

INSERT INTO "pins" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Pin1"], ["created_at", "2020-05-16 09:53:54.822122"], ["updated_at", "2020-05-16 09:53:54.822122"]]
---
  def create
    @pin = Pin.new(pin_params)
    @pin.user = current_user
    @pin.save

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "pins" SET "title" = $1, "image" = $2, "updated_at" = $3 WHERE "pins"."id" = $4  [["title", "Pin1"], ["image", ""], ["updated_at", "2020-05-16 09:50:51.727659"], ["id", 1]]
---
  def update
    @pin = Pin.find(params[:id])

    @pin.update(pin_params)

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "pins" WHERE "pins"."id" = $1  [["id", 1]]
---
  def destroy
    @pin = Pin.find(params[:id])
    @pin.destroy